; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	spectrograph2 - mode
	spectrograph1 - mode
	thermograph3 - mode
	infrared0 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation9 - direction
	Star13 - direction
	Star14 - direction
	Star7 - direction
	GroundStation8 - direction
	GroundStation11 - direction
	GroundStation12 - direction
	Star6 - direction
	GroundStation10 - direction
	Star5 - direction
	GroundStation4 - direction
	Star3 - direction
	GroundStation1 - direction
	Star15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
	Planet19 - direction
	Planet20 - direction
	Planet21 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation11)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 GroundStation12)
	(calibration_target instrument1 GroundStation11)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 GroundStation8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star15)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 GroundStation10)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star15)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 Star5)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon17)
	(supports instrument4 infrared0)
	(supports instrument4 thermograph3)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 Star3)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
)
(:goal (and
	(pointing satellite0 Phenomenon17)
	(pointing satellite2 Star13)
	(pointing satellite3 GroundStation8)
	(have_image Star15 thermograph3)
	(have_image Phenomenon17 spectrograph2)
	(have_image Phenomenon18 spectrograph2)
	(have_image Planet19 infrared0)
	(have_image Planet20 spectrograph1)
	(have_image Planet21 spectrograph2)
))

)

; plan
1. (turn_to satellite3 groundstation1 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 groundstation1)
   goals met: 0 of 9
2. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 0 of 9
3. (calibrate satellite3 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 0 of 9
4. (turn_to satellite3 planet19 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 planet19)
   goals met: 0 of 9
5. (turn_to satellite2 groundstation4 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 groundstation4)
   goals met: 0 of 9
6. (turn_to satellite0 phenomenon17 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 phenomenon17)
   goals met: 1 of 9
7. (take_image satellite3 planet19 instrument4 infrared0)
   added: (have_image planet19 infrared0)
   goals met: 2 of 9
8. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 2 of 9
9. (calibrate satellite2 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 2 of 9
10. (turn_to satellite2 phenomenon17 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 phenomenon17)
   goals met: 2 of 9
11. (take_image satellite2 phenomenon17 instrument3 spectrograph2)
   added: (have_image phenomenon17 spectrograph2)
   goals met: 3 of 9
12. (turn_to satellite2 phenomenon18 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 phenomenon18)
   goals met: 3 of 9
13. (take_image satellite2 phenomenon18 instrument3 spectrograph2)
   added: (have_image phenomenon18 spectrograph2)
   goals met: 4 of 9
14. (turn_to satellite2 planet21 phenomenon18)
   deleted: (pointing satellite2 phenomenon18)
   added: (pointing satellite2 planet21)
   goals met: 4 of 9
15. (take_image satellite2 planet21 instrument3 spectrograph2)
   added: (have_image planet21 spectrograph2)
   goals met: 5 of 9
16. (turn_to satellite2 star13 planet21)
   deleted: (pointing satellite2 planet21)
   added: (pointing satellite2 star13)
   goals met: 6 of 9
17. (turn_to satellite3 planet20 planet19)
   deleted: (pointing satellite3 planet19)
   added: (pointing satellite3 planet20)
   goals met: 6 of 9
18. (take_image satellite3 planet20 instrument4 spectrograph1)
   added: (have_image planet20 spectrograph1)
   goals met: 7 of 9
19. (turn_to satellite3 star15 planet20)
   deleted: (pointing satellite3 planet20)
   added: (pointing satellite3 star15)
   goals met: 7 of 9
20. (take_image satellite3 star15 instrument4 thermograph3)
   added: (have_image star15 thermograph3)
   goals met: 8 of 9
21. (turn_to satellite3 groundstation8 star15)
   deleted: (pointing satellite3 star15)
   added: (pointing satellite3 groundstation8)
   goals met: 9 of 9
